Обработки/Reports/_ПереченьАктивовПоПокрытиюФьючерса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ПереченьАктивовПоПокрытиюФьючерса</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ПереченьАктивовПоПокрытиюФьючерса/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, 
		"Перечень активов по покрытию фьючерса", 
		"0.10", 
		"", 
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Валюта");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	
#Область ТекстЗапроса	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказатели.Значение КАК СЧА,
		|	СчетаДоверительногоУправления.Ссылка.НомерДоговора КАК НомерДоговораДУ,
		|	СчетаДоверительногоУправления.Ссылка.ДатаЗаключения КАК ДатаЗаключенияДУ,
		|	&Период КАК Период,
		|	РеквизитыОрганизации.КраткоеНаименованиеПоУставу + "" ДУ средствами "" + ВЫБОР
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА ""пенсионных резервов ""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА ""пенсионных накоплений ""
		|	КОНЕЦ + РеквизитыКлиента.КраткоеНаименованиеПоУставу КАК НаименованиеСчетаДУ,
		|	&ТекущаяДата КАК ТекущаяДата
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО (ФинансовыеПоказатели.СубъектАналитики = СчетаДоверительногоУправления.Ссылка)
		|			И (ФинансовыеПоказатели.Активность)
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (КОНЕЦПЕРИОДА(ФинансовыеПоказатели.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(&Период, ДЕНЬ))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|					&Период,
		|					Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыКлиента
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыКлиента.ЮрФизЛицо
		|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыОрганизации
		|		ПО СчетаДоверительногоУправления.Организация.ЮрФизЛицо = РеквизитыОрганизации.ЮрФизЛицо
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Курс "" + КурсыВалютСрезПоследних.Валюта.Наименование + ""/"" + Организации.ВалютаУчета.Наименование КАК НаименованиеКурса,
		|	КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК Курс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних,
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ОстаткиЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|			ТОГДА ""Фьючерс""
		|	КОНЕЦ КАК ВидИнструмента,
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.Наименование КАК ДлинныйКодИнструмента,
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.БазовыйАктив.Валюта.Наименование КАК ВалютаНоминала,
		|	ВЫБОР
		|		КОГДА ОстаткиЦенныхБумагОстатки.КоличествоОстаток > 0
		|			ТОГДА ОстаткиЦенныхБумагОстатки.КоличествоОстаток
		|		ИНАЧЕ -ОстаткиЦенныхБумагОстатки.КоличествоОстаток
		|	КОНЕЦ КАК Количество,
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.Исполнение КАК ДатаПогашения,
		|	""-"" КАК Эмитент,
		|	""-"" КАК ИсточникЦены,
		|	""-"" КАК РегНомер,
		|	ВЫБОР
		|		КОГДА ОстаткиЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|			ТОГДА ВЫБОР
		|					КОГДА ОстаткиЦенныхБумагОстатки.КоличествоОстаток > 0
		|						ТОГДА ОстаткиЦенныхБумагОстатки.КоличествоОстаток
		|					ИНАЧЕ -ОстаткиЦенныхБумагОстатки.КоличествоОстаток
		|				КОНЕЦ * ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.Лот
		|	КОНЕЦ КАК Стоимость
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)) КАК ОстаткиЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстатки.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ""Денежные средства на расчетном счете"" 
		|		ИНАЧЕ ""Денежные средства на брокерском счете""
		|	КОНЕЦ КАК ВидИнструмента,
		|	""-"" КАК ДлинныйКодИнструмента,
		|	ОстаткиДенежныхСредствОстатки.Валюта.Наименование КАК ВалютаНоминала,
		|	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК Количество,
		|	""-"" КАК Эмитент,
		|	""ЦБ РФ"" КАК ИсточникЦены,
		|	""-"" КАК РегНомер,
		|	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК Стоимость
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Валюта = &Валюта) КАК ОстаткиДенежныхСредствОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК ДлинныйКодИнструмента,
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.ВалютаНоминала.Наименование КАК ВалютаНоминала,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.ДатаПогашения КАК ДатаПогашения,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК Эмитент,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК РегНомер,
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.Наименование КАК ЦеннаяБумагаНаименование,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток * СтоимостьПереоценки.Цена КАК Стоимость,
		|	СтоимостьПереоценки.Цена ЕСТЬ NULL КАК НетЦеныПереоценки
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|				И Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|				И ЕСТЬNULL(ЦеннаяБумага.ВалютаНоминала, НЕОПРЕДЕЛЕНО) = &Валюта) КАК ОстаткиЦенныхБумагОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|			И (НЕ РеквизитыЮридическихЛицСрезПоследних.РезидентРФ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|		ПО (СтоимостьПереоценки.Период = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ))
		|			И (СтоимостьПереоценки.Организация = &Организация)
		|			И (СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|			И (СтоимостьПереоценки.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет))
		|			И (СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки))
		|			И (СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении))
		|			И ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = СтоимостьПереоценки.ЦеннаяБумага";
#КонецОбласти
	
	Запрос.УстановитьПараметр("Организация"					, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период"						, КонецДня(ЭтотОбъект.Период));
	Запрос.УстановитьПараметр("ТекущаяДата"					, КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Валюта"						, ЭтотОбъект.Валюта);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	СЧА			= Пакет[0].Выгрузить();
	КурсыВалют	= Пакет[1].Выгрузить();
	Фьючерсы	= Пакет[2].Выгрузить();
	Деньги		= Пакет[3].Выгрузить();
	ЦенныеБумаги= Пакет[4].Выгрузить();
	
	Если ЦенныеБумаги.НайтиСтроки(Новый Структура("НетЦеныПереоценки", Истина)).Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По счету ДУ " + ЭтотОбъект.СчетДоверительногоУправления + " на " + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yy") + " нет Регистрации стоимости переоценки!");
	КонецЕсли;
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьРаздел	= Макет.ПолучитьОбласть("Раздел");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	ОбластьИтог		= Макет.ПолучитьОбласть("Итог");
	
	//Шапка
	Если СЧА.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, СЧА[0]);
	КонецЕсли;
	Если КурсыВалют.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, КурсыВалют[0]);
	КонецЕсли;
	
	ОбластьШапка.Параметры.НаименованиеДоговораДУ	= "Договор ДУ " + СЧА[0].НомерДоговораДУ + " от " + Формат(СЧА[0].ДатаЗаключенияДУ, "ДФ='dd.MM.yyyy ""г.""'");
	ОбластьШапка.Параметры.ПревышениеПокрытия		= Деньги.Итог("Стоимость") + ЦенныеБумаги.Итог("Стоимость") - Фьючерсы.Итог("Стоимость");
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	ОбластьРаздел.Параметры.НаименованиеРаздела = "ОКП (СКП)";
	ДокументРезультат.Вывести(ОбластьРаздел);
	
	Для Каждого СтрокаФьючерсы Из Фьючерсы Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаФьючерсы);
		ОбластьСтрока.Параметры.НомерСтроки = Фьючерсы.Индекс(СтрокаФьючерсы) + 1;
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьРаздел.Параметры.НаименованиеРаздела = "ПСКП";
	ДокументРезультат.Вывести(ОбластьРаздел);
	
	ОбластьСтрока.Параметры.НомерСтроки = 1;
	ОбластьСтрока.Параметры.ВидИнструмента			= "Денежные средства, в том числе";
	ОбластьСтрока.Параметры.ДлинныйКодИнструмента	= "-";
	ОбластьСтрока.Параметры.ВалютаНоминала			= ЭтотОбъект.Валюта.Наименование;
	ОбластьСтрока.Параметры.Количество				= Деньги.Итог("Количество");
	ОбластьСтрока.Параметры.ДатаПогашения			= "-";
	ОбластьСтрока.Параметры.ИсточникЦены			= "ЦБ РФ";
	ОбластьСтрока.Параметры.РегНомер				= "-";
	ОбластьСтрока.Параметры.Стоимость				= Деньги.Итог("Стоимость");
	ДокументРезультат.Вывести(ОбластьСтрока);
	
	Для Каждого СтрокаДеньги Из Деньги Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаДеньги);
		ОбластьСтрока.Параметры.НомерСтроки = "1." + Строка(Деньги.Индекс(СтрокаДеньги) + 1);
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьСтрока.Параметры.НомерСтроки = 2;
	ОбластьСтрока.Параметры.ВидИнструмента			= "Ценные бумаги иностранных эмитентов, в т.ч.";
	ОбластьСтрока.Параметры.Количество				= "-";
	ОбластьСтрока.Параметры.Стоимость				= ЦенныеБумаги.Итог("Стоимость");
	ДокументРезультат.Вывести(ОбластьСтрока);
	
	Для Каждого СтрокаЦенныеБумаги Из ЦенныеБумаги Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаЦенныеБумаги);
		ОбластьСтрока.Параметры.НомерСтроки = "2." + Строка(ЦенныеБумаги.Индекс(СтрокаЦенныеБумаги) + 1);
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьИтог.Параметры.НаименованиеРаздела = "Итого ПСКП";
	ОбластьИтог.Параметры.Стоимость	= Деньги.Итог("Стоимость") + ЦенныеБумаги.Итог("Стоимость");
	ДокументРезультат.Вывести(ОбластьИтог);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
КонецПроцедуры
